
#ifndef __STRIPC_H__
#define __STRIPC_H__

//----------------------------------------------------------------------
// Функции и типы для работы со строками
//----------------------------------------------------------------------

//! Определим тип указателя на строку,
//! чтобы исключить директивы препроцессора
//! в интерфейсных функциях

#ifdef __linux__
    typedef char           IPC_str;
#else
    #ifdef _WIN64
        typedef wchar_t    IPC_str;
    #else
        typedef char       IPC_str;
    #endif
#endif

#endif //__STRIPC_H__

